lvx/base/InformationRegisters/бит_Удалить_МаскиКодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_Удалить_МаскиКодов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МаскаКода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаскаТекущая</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автозаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Comment>Объект системы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/InformationRegisters/бит_МаскиКодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_МаскиКодов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МаскаКода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаскаТекущая</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автозаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Comment>Объект системы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/InformationRegisters/бит_Удалить_МаскиКодов/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаСпискаРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ТекущаяЗапись = Источник.Запись;
	ОбъектСистемы = ТекущаяЗапись.ОбъектСистемы;
	МаскаКода     = ТекущаяЗапись.МаскаКода;
	МаскаТекущая  = ТекущаяЗапись.МаскаТекущая;
	
	Если МаскаКода <> МаскаТекущая И ЕстьОбъектыДляКонвертации(ОбъектСистемы) Тогда
		ТекстСообщения = НСтр("ru='Необходимо конвертировать коды для объекта %1.';
							  |en='It is necessary to convert the object codes to %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(ОбъектСистемы));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры // СписокОбработкаЗаписиНового()

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Если Не ВозможноУдалитьЗапись(Элемент.ВыделенныеСтроки) Тогда
		Отказ = Истина; 	
	КонецЕсли;          	

КонецПроцедуры // СписокПередУдалением()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КонвертироватьКоды(Команда)
	
	МассивИзмененных = КонвертироватьКодыСервер();
	
	Если МассивИзмененных.Количество() > 0 Тогда
		
		МассивВыделенных = Элементы.Список.ВыделенныеСтроки;
		Для каждого ИзмененныйТип Из МассивИзмененных Цикл			
			ОповеститьОбИзменении(Тип(ИзмененныйТип));
		КонецЦикла;
	
		ТекстСообщения = НСтр("ru='Выполнена конвертация кодов.';en='Conversion of codes completed'");		
				
	Иначе	
		
		ТекстСообщения = НСтр("ru='Конвертация кодов не выполнена.';en='Code conversion is not executed.'");
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры // КонвертироватьКоды()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция проверяет возможность удаления строк.
// 
// Параметры:
//  ВыделенныеСтроки - Массив
//  
// Возвращаемое значение:
//   Булево
// 
&НаСервере
Функция ВозможноУдалитьЗапись(Знач ВыделенныеСтроки)

	ВозможноУдалить = Истина;
	
	Для каждого ЭлЗапись Из ВыделенныеСтроки Цикл
		
		ТекОбъектСистемы = ЭлЗапись.ОбъектСистемы;
		ТекИмяРеквизита  = ЭлЗапись.ИмяРеквизита;
		
		Если Лев(ТекОбъектСистемы.ИмяОбъектаПолное, 10) = "ПланСчетов" Тогда
			
			ТекстСообщения = НСтр("ru='Нельзя удалить запись для плана счетов. (%1 - %2)';
								  |en='You can not remove an entry for the chart of accounts. (%1 - %2)'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекОбъектСистемы, ТекИмяРеквизита);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			ВозможноУдалить = Ложь;
			
		Иначе 					
			
			МаскаПоУмолчанию = РегистрыСведений.бит_МаскиКодов.ПолучитьМаскуКодаПоУмолчанию(ТекОбъектСистемы, ТекИмяРеквизита);
			
			МенеджерЗаписи = РегистрыСведений.бит_МаскиКодов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ОбъектСистемы = ТекОбъектСистемы;
			МенеджерЗаписи.ИмяРеквизита  = ТекИмяРеквизита; 		
			МенеджерЗаписи.Прочитать();	
			
			Если МаскаПоУмолчанию <> МенеджерЗаписи.МаскаТекущая Тогда				
				ТекстСообщения = НСтр("ru='Нельзя удалить запись с установленной маской отличной от маски по умолчанию. (%1 - %2)';
									  |en='You can not delete a record with a mask set is different from the default mask. (%1 - %2)'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ТекОбъектСистемы, ТекИмяРеквизита);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);					 
				ВозможноУдалить = Ложь;				
			КонецЕсли;
		
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ВозможноУдалить;
	
КонецФункции // ВозможноУдалитьЗапись()

// Процедура ковертирует коды планов счетов в соответствии с новой маской.
// 
// Параметры:
// 
&НаСервере
Функция КонвертироватьКодыСервер()
	
	МассивВыделенных = Элементы.Список.ВыделенныеСтроки;
	Если МассивВыделенных.Количество() > 0 Тогда
		
		МассивИзмененных = РегистрыСведений.бит_МаскиКодов.КонвертироватьКоды(МассивВыделенных);
		Элементы.Список.Обновить();		
	
	КонецЕсли;
	
	Возврат МассивИзмененных;

КонецФункции // КонвертироватьКодыСервер()
             
// Функция проверяет есть ли счета в плане.
// 
// Параметры:
//  ТекОбъектСистемы - СправочникСсылка.бит_ОбъектыСистемы
//  
// Возвращаемое значение:
//   Булево
// 
&НаСервере
Функция ЕстьСчета(ТекОбъектСистемы)

	Выборка = ПланыСчетов[ТекОбъектСистемы.ИмяОбъекта].Выбрать();	
	ЕстьЗаписанныеСчета = Выборка.Следующий(); 	

	Возврат ЕстьЗаписанныеСчета;
	
КонецФункции // ЕстьСчета()

// Функция проверяет есть ли объекты.
// 
// Параметры:
//  ТекОбъектСистемы - СправочникСсылка.бит_ОбъектыСистемы
//  
// Возвращаемое значение:
//   Булево
// 
&НаСервере
Функция ЕстьОбъектыДляКонвертации(ТекОбъектСистемы)

	Если ТекОбъектСистемы.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.ПланСчетов Тогда 		
		Выборка = ПланыСчетов[ТекОбъектСистемы.ИмяОбъекта].Выбрать();	            		
	ИначеЕсли ТекОбъектСистемы.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Справочник Тогда 		
		Выборка = Справочники[ТекОбъектСистемы.ИмяОбъекта].Выбрать();  	
	КонецЕсли;  	

	ЕстьОбъекты = Выборка.Следующий();
	
	Возврат ЕстьОбъекты;
	
КонецФункции // ЕстьОбъектыДляКонвертации() 

#КонецОбласти
